Revit 2024 API
CustomFieldData Methods
The CustomFieldData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCustomFieldId
 Gets an unique identifier of the custom field.
GetCustomFieldProperties
 Gets an instance of ICustomFieldProperties which represents the properties of this field.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCustomFieldProperties
 Sets an instance of ICustomFieldProperties which represents the properties of this field.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
ValidateCustomFieldProperties
 Validates the custom field properties.
See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace